In [5]:
%load_ext sql
%sql mysql+pymysql://root:@localhost:3307/win

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Frames</h1>

<br><br>
<div style="text-align:justify; color:black; font-size:28px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"><p>A frame in a window function is a subset of rows within the partition that
determines the scope of the window function calculation. <br><img style="display: block;margin-left: auto;margin-right: auto;width: 50%; " src="./sql_images/window_f.png">
</p>
</div><br>

<br><br>
<div style="text-align:justify; color:red; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">A general (and much simplified) format of a window function call is: <ul>function_name OVER (PARTITION BY ... ORDER BY ... frame_clause)</ul></div><br>

In [2]:
%%sql
SELECT * FROM data

 * mysql+pymysql://root:***@localhost:3307/win
6 rows affected.

[(1, 2015, 8.0),
 (2, 2015, 8.5),
 (3, 2015, 9.0),
 (4, 2016, 8.0),
 (5, 2016, 8.0),
 (6, 2017, 7.0)]

In [3]:
%%sql
SELECT *,

AVG(rating) OVER(PARTITION BY rating) 

AS `year_avg` FROM data

 * mysql+pymysql://root:***@localhost:3307/win
6 rows affected.

[(6, 2017, 7.0, 7.0),
 (5, 2016, 8.0, 8.0),
 (1, 2015, 8.0, 8.0),
 (4, 2016, 8.0, 8.0),
 (2, 2015, 8.5, 8.5),
 (3, 2015, 9.0, 9.0)]

<br><br>
<div style="text-align:justify; color:green; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Here AVG() is the function_name <br> and OVER(PARTITION BY rating) are related with Window<br>frame_clause that are not use in above</div><br>

<br><br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Here is the frame_clause</div><br>

<br><br>

<div style="text-align:justify; color:red; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">function_name OVER (PARTITION BY ... ORDER BY ... frame_clause)<br></div><br>
<br>

<div style="text-align:justify; color:blue; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">frame_clause : <ul>mode BETWEEN frame_start AND frame_end [ frame_exclusion ]</ul><br></div><br>


<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">This syntax can be divided into three sections : 
<ul style='color:red;'>mode <ol style='color:black;'>sets the way a database engine treats input rows.<br><br> There are three possible values:<br> <br><ol style='color:green;'>ROWS</ol> <ol style='color:green;'>GROUPS</ol> <ol style='color:green;'>RANGE</ol></ol></ul><br>

<ul style='color:red;'>frame_start and frame_end <ol style='color:black;'>define where a window frame starts and where it ends.</ol></ul><br>
<ul style='color:red;'>frame_exclusion 
<ol style='color:black;'>can be used to specify parts of a window frame that have to be excluded from the calculations.</ol></ul>

<h1 style="text-align:center; color:#005bbd; font-size:50px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">Rows Mode</h1>

<br><br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">The ROWS mode is the simplest one. It instructs the database to treat each input row separately, as individual entities:<br><img style="display: block;margin-left: auto;margin-right: auto;width: 70%; " src="./sql_images/w_row_md.png"><br>
    <ul>
In the ROWS mode frame_start and frame_end allow us to specify which rows the window frame starts and ends with.<br><br>They accept the following values:
        <br><br>
    <ol style='color:red;'>UNBOUNDED PRECEDING - <ol style='color:black;'>(possible only in frame_start) start with the first row of the partition</ol><br></ol>        
    <ol style='color:red;'>offset PRECEDING - <ol style='color:black;'>start/end with a given number of rows before the current row</ol><br></ol>
        
<ol style='color:red;'>CURRENT ROW - <ol style='color:black;'>start/end with the current row</ol></ol><br>
<ol style='color:red;'>offset FOLLOWING - <ol style='color:black;'>start/end with a given number of rows after the current row</ol><br>
</ol>
<ol style='color:red;'> UNBOUNDED FOLLOWING -<ol style='color:black;'> (possible only as a frame_end) end with the last row of the partition
    </ul>

</div><br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now Understand the Syntax<ul>mode BETWEEN frame_start AND frame_end [ frame_exclusion ]</ul><br></div><br>

In [7]:
%%sql 
SELECT * FROM data

 * mysql+pymysql://root:***@localhost:3307/win
6 rows affected.

[(1, 2015, 8.0),
 (2, 2015, 8.5),
 (3, 2015, 9.0),
 (4, 2016, 8.0),
 (5, 2016, 8.0),
 (6, 2017, 7.0)]

In [29]:
%%sql 
SELECT *,
LAST_VALUE(rating) OVER(ORDER BY rating DESC) AS `low_rating`
FROM data
ORDER BY id ASC

 * mysql+pymysql://root:***@localhost:3307/win
6 rows affected.

[(1, 2015, 8.0, 8.0),
 (2, 2015, 8.5, 8.5),
 (3, 2015, 9.0, 9.0),
 (4, 2016, 8.0, 8.0),
 (5, 2016, 8.0, 8.0),
 (6, 2017, 7.0, 7.0)]

<br><br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Here low rating is 7.0 So cant Show 7.0 at all ?</div><br>

<h1 style="text-align:center; color:blue; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING</h1>

<div style="text-align:center; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"><ul>mode BETWEEN frame_start AND frame_end [ frame_exclusion ]</ul><br></div><br>

In [42]:
%%sql 
SELECT * FROM data

 * mysql+pymysql://root:***@localhost:3307/win
6 rows affected.

[(1, 2015, 8.0),
 (2, 2015, 8.5),
 (3, 2015, 9.0),
 (4, 2016, 8.0),
 (5, 2016, 8.0),
 (6, 2017, 7.0)]

In [40]:
%%sql 
SELECT *,
LAST_VALUE(rating) OVER(ORDER BY rating DESC 

    ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING

                   ) AS `low_rating`
FROM data

 * mysql+pymysql://root:***@localhost:3307/win
6 rows affected.

[(3, 2015, 9.0, 7.0),
 (2, 2015, 8.5, 7.0),
 (1, 2015, 8.0, 7.0),
 (4, 2016, 8.0, 7.0),
 (5, 2016, 8.0, 7.0),
 (6, 2017, 7.0, 7.0)]

<br><br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Here i use <ul> ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING </ul> Understand with Diagram
</div><img style="display: block;margin-left: auto;margin-right: auto;width: 70%; " src="./sql_images/row_1.png"><br><br>

<br><br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Here if i use First Value with UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING</div><br>

In [41]:
%%sql 
SELECT *,
FIRST_VALUE(rating) OVER(ORDER BY rating DESC 

    ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING

                   ) AS `high_rating`
FROM data

 * mysql+pymysql://root:***@localhost:3307/win
6 rows affected.

[(3, 2015, 9.0, 9.0),
 (2, 2015, 8.5, 9.0),
 (1, 2015, 8.0, 9.0),
 (4, 2016, 8.0, 9.0),
 (5, 2016, 8.0, 9.0),
 (6, 2017, 7.0, 9.0)]

<br><br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Here i use First_value with <ul> ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING </ul> Understand with Diagram
</div><img style="display: block;margin-left: auto;margin-right: auto;width: 70%; " src="./sql_images/row_2.png"><br><br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">UNBOUNDED PRECEDING means First Row<br>UNBOUNDED FOLLOWING means Last Row</div>

<h1 style="text-align:center; color:blue; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING</h1>

In [55]:
%%sql 
SELECT *,
LAST_VALUE(rating) OVER(ORDER BY rating DESC 

    ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING

                   ) AS `low_rating`
FROM data

 * mysql+pymysql://root:***@localhost:3307/win
6 rows affected.

[(3, 2015, 9.0, 8.5),
 (2, 2015, 8.5, 8.0),
 (1, 2015, 8.0, 8.0),
 (4, 2016, 8.0, 8.0),
 (5, 2016, 8.0, 7.0),
 (6, 2017, 7.0, 7.0)]

<br><br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Here i use Last_value with <ul> ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING </ul> Understand with Diagram
<img style="display: block;margin-left: auto;margin-right: auto;width: 70%; " src="./sql_images/row_3.png"><br><br>

1 PRECEDING <ul>means above 1 row select</ul><ul>if above row are not exists than select Current row</ul>
1 FOLLOWING <ul>means below 1 row select</ul><ul>if below row are not exists than select Current row</ul>


</div>

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">if i use 2 Preceding and 2 following thats means 2 above row (Preceding) and 2 below row (following)</div>

In [60]:
%%sql 
SELECT *,
LAST_VALUE(rating) OVER(ORDER BY rating DESC 

    ROWS BETWEEN 2 PRECEDING AND 2 FOLLOWING

                   ) AS `low_rating`
FROM data

 * mysql+pymysql://root:***@localhost:3307/win
6 rows affected.

[(3, 2015, 9.0, 8.0),
 (2, 2015, 8.5, 8.0),
 (1, 2015, 8.0, 8.0),
 (4, 2016, 8.0, 7.0),
 (5, 2016, 8.0, 7.0),
 (6, 2017, 7.0, 7.0)]

<br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul>x PRECEDING: <ol>If there are rows above the current row, it includes the row that is x rows before the current row. If there are no rows before the current row or if the number of rows above is less than x, it includes all the rows up to the current row.</ol></ul>

<ul style='color:green;'>If there are rows above the current row, include the row that is x rows before the current row.<br>
    If there are no rows before the current row or if the number of rows above is less than x, include all the rows up to the current row.</ul></div>

<br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">
<ul>x FOLLOWING: <ol>If there are rows below the current row, it includes the row that is x rows after the current row. If there are no rows below the current row or if the number of rows below is less than x, it includes all the rows starting from the current row.
</ol></ul>

<ul style='color:green;'>
    If there are rows below the current row, include the row that is x rows after the current row.<br>
    If there are no rows below the current row or if the number of rows below is less than x, include all the rows starting from the current row.</ul></div>

<h1 style="text-align:center; color:blue; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW </h1>

In [62]:
%%sql 
SELECT *,
LAST_VALUE(rating) OVER(ORDER BY rating DESC ) AS `low_rating`
FROM data

 * mysql+pymysql://root:***@localhost:3307/win
6 rows affected.

[(3, 2015, 9.0, 9.0),
 (2, 2015, 8.5, 8.5),
 (1, 2015, 8.0, 8.0),
 (4, 2016, 8.0, 8.0),
 (5, 2016, 8.0, 8.0),
 (6, 2017, 7.0, 7.0)]

In [77]:
%%sql 
SELECT *,
LAST_VALUE(rating) OVER(ORDER BY rating DESC ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW                       
) AS `low_rating`
FROM data

 * mysql+pymysql://root:***@localhost:3307/win
6 rows affected.

[(3, 2015, 9.0, 9.0),
 (2, 2015, 8.5, 8.5),
 (1, 2015, 8.0, 8.0),
 (4, 2016, 8.0, 8.0),
 (5, 2016, 8.0, 8.0),
 (6, 2017, 7.0, 7.0)]

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Both result are same that means at default mySql follow the rule : <br><br><ul>ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW </ul></div><br>

<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;"> Lets Understand it</div><img style="display: block;margin-left: auto;margin-right: auto;width: 70%; " src="./sql_images/row_4.png"><br><br>
<br>

<h1 style="text-align:center; color:blue; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px Black;">ROWS BETWEEN UNBOUNDED PRECEDING AND EXCLUDE CURRENT ROW </h1>

In [78]:
%%sql 
SELECT *,
LAST_VALUE(rating) OVER(ORDER BY rating DESC ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW                       
) AS `low_rating`
FROM data

 * mysql+pymysql://root:***@localhost:3307/win
6 rows affected.

[(3, 2015, 9.0, 9.0),
 (2, 2015, 8.5, 8.5),
 (1, 2015, 8.0, 8.0),
 (4, 2016, 8.0, 8.0),
 (5, 2016, 8.0, 8.0),
 (6, 2017, 7.0, 7.0)]

<br><br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Note We also use PARTITION BY</div><br>

In [82]:
%%sql 
SELECT *,
LAST_VALUE(rating) 
OVER(PARTITION BY release_year ORDER BY rating DESC ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW                       
) AS `low_rating`
FROM data

 * mysql+pymysql://root:***@localhost:3307/win
6 rows affected.

[(3, 2015, 9.0, 9.0),
 (2, 2015, 8.5, 8.5),
 (1, 2015, 8.0, 8.0),
 (4, 2016, 8.0, 8.0),
 (5, 2016, 8.0, 8.0),
 (6, 2017, 7.0, 7.0)]

In [83]:
%%sql 
SELECT *,
LAST_VALUE(rating) 
OVER(
    PARTITION BY release_year 
    ORDER BY rating DESC 
    ROWS BETWEEN 1 PRECEDING AND 1 FOLLOWING                  
) AS `low_rating`
FROM data

 * mysql+pymysql://root:***@localhost:3307/win
6 rows affected.

[(3, 2015, 9.0, 8.5),
 (2, 2015, 8.5, 8.0),
 (1, 2015, 8.0, 8.0),
 (4, 2016, 8.0, 8.0),
 (5, 2016, 8.0, 8.0),
 (6, 2017, 7.0, 7.0)]

In [85]:
%%sql 
SELECT *,
LAST_VALUE(rating) 
OVER(
    PARTITION BY release_year 
    ORDER BY rating DESC 
    ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING                  
) AS `low_rating`
FROM data

 * mysql+pymysql://root:***@localhost:3307/win
6 rows affected.

[(3, 2015, 9.0, 8.0),
 (2, 2015, 8.5, 8.0),
 (1, 2015, 8.0, 8.0),
 (4, 2016, 8.0, 8.0),
 (5, 2016, 8.0, 8.0),
 (6, 2017, 7.0, 7.0)]

<br><br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">We also add alias with WINDOW Keyword</div><br>

In [91]:
%%sql 
SELECT *,
LAST_VALUE(rating) 

OVER lr AS `low_rating`

FROM data

WINDOW lr AS (

    PARTITION BY release_year 
    ORDER BY rating DESC 
    ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING                  

)

 * mysql+pymysql://root:***@localhost:3307/win
6 rows affected.

[(3, 2015, 9.0, 8.0),
 (2, 2015, 8.5, 8.0),
 (1, 2015, 8.0, 8.0),
 (4, 2016, 8.0, 8.0),
 (5, 2016, 8.0, 8.0),
 (6, 2017, 7.0, 7.0)]

<br><br>
<div style="text-align:justify; color:black; font-size:25px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Now we need to extract also user id so we also use lr with  new widnow function</div><br>

In [95]:
%%sql 
SELECT *,

LAST_VALUE(rating) OVER lr AS `low_rating`,
LAST_VALUE(id) OVER lr AS `low_rating_user_id`

FROM data

WINDOW lr AS (

    PARTITION BY release_year 
    ORDER BY rating DESC 
    ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING                  

)

 * mysql+pymysql://root:***@localhost:3307/win
6 rows affected.

[(3, 2015, 9.0, 8.0, 1),
 (2, 2015, 8.5, 8.0, 1),
 (1, 2015, 8.0, 8.0, 1),
 (4, 2016, 8.0, 8.0, 5),
 (5, 2016, 8.0, 8.0, 5),
 (6, 2017, 7.0, 7.0, 6)]

<div style="text-align:left; color:black; font-size:20px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Summary
    <ul>What is Frames</ul>
    <ul>Rows, GROUP, Range</ul>
    <ul>UNBONDED PRECEDING  (start row)</ul>
    <ul>UNBONDED FOLLOWING  (end row)</ul>
    <ul>X PRECEDING  (start row no with X)</ul>
    <ul>X FOLLOWING  (end row no with X)</ul>
    <ul>CURRENT ROW  (end current row selected)</ul>
    <ul>Also we can use PARTITION BY</ul>
    <ul>Alias WINDOW keyword</ul>
    <ul>Use Alias WINDOW keyword With multiples window functions</ul>

    

    



</div>
<hr>
<div style="text-align:left; color:black; font-size:20px; font-family:Sans-serif; font-style: oblique; text-shadow: 0 0 3px white, 0 0 1px black;">Commands
<i style="color:green;">
<ul>ORDER BY col DESC/ASC ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING</ul>
    <ul>PARTITION BY col1 ORDER BY col2 DESC/ASC ROWS BETWEEN UNBOUNDED PRECEDING AND UNBOUNDED FOLLOWING</ul>
        <hr>
<ul>ORDER BY col DESC/ASC ROWS BETWEEN X PRECEDING AND X FOLLOWING</ul>
<ul>PARTITION BY col1 ORDER BY col2 DESC/ASC ROWS BETWEEN X PRECEDING AND X FOLLOWING</ul>
    <hr>
<ul>ORDER BY col DESC/ASC ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW</ul>
<ul>PARTITION BY col1 ORDER BY col2 DESC/ASC ROWS BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW</ul>

    
</i>

</div>